In [1]:
import numpy as np
import pandas as pd

In [2]:
cars_per_cap = [809, 731, 588, 18, 200, 70, 45]
country = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
drives_right = [True, False, False, False, True, True, True]

In [3]:
data = {"car":cars_per_cap, "countries":country, "drive_lane_right?" : drives_right}

{'car': [809, 731, 588, 18, 200, 70, 45],
 'countries': ['United States',
  'Australia',
  'Japan',
  'India',
  'Russia',
  'Morocco',
  'Egypt'],
 'drive_lane_right?': [True, False, False, False, True, True, True]}

In [5]:
type(data)

dict

In [8]:
data = pd.DataFrame(data)

In [9]:
type(data)

pandas.core.frame.DataFrame

In [10]:
data

   car      countries  drive_lane_right?
0  809  United States               True
1  731      Australia              False
2  588          Japan              False
3   18          India              False
4  200         Russia               True
5   70        Morocco               True
6   45          Egypt               True

In [18]:
l = ["Nishanth Fiona","Jade Nguyen","Eloora Dutta", 25,22,22]
newl = pd.DataFrame(l,columns = ["Name"])

In [16]:
newl

             Name
0  Nishanth Fiona
1     Jade Nguyen
2    Eloora Dutta
3              25
4              22
5              22

In [19]:
cars_df = pd.read_csv("cars.csv")

In [20]:
cars_df

    USCA   US United States    809  FALSE
0  ASPAC  AUS     Australia  731.0   True
1  ASPAC  JAP         Japan  588.0   True
2  ASPAC   IN         India   18.0   True
3  ASPAC   RU        Russia  200.0  False
4  LATAM  MOR       Morocco   70.0  False
5    AFR   EG         Egypt   45.0  False
6    EUR  ENG       England    NaN   True

In [22]:
cars_df = pd.read_csv("cars.csv", header = None)
cars_df

       0    1              2      3      4
0   USCA   US  United States  809.0  False
1  ASPAC  AUS      Australia  731.0   True
2  ASPAC  JAP          Japan  588.0   True
3  ASPAC   IN          India   18.0   True
4  ASPAC   RU         Russia  200.0  False
5  LATAM  MOR        Morocco   70.0  False
6    AFR   EG          Egypt   45.0  False
7    EUR  ENG        England    NaN   True

In [24]:
cars_df.columns

Index([0, 1, 2, 3, 4], dtype='int64')

In [25]:
cars_df.columns = ['Country Code',"Country","Region Code","Car Per Cap","Drive Right?"]

In [26]:
cars_df.columns

Index(['Country Code', 'Country', 'Region Code', 'Car Per Cap',
       'Drive Right?'],
      dtype='object')

In [27]:
cars_df

  Country Code Country    Region Code  Car Per Cap  Drive Right?
0         USCA      US  United States        809.0         False
1        ASPAC     AUS      Australia        731.0          True
2        ASPAC     JAP          Japan        588.0          True
3        ASPAC      IN          India         18.0          True
4        ASPAC      RU         Russia        200.0         False
5        LATAM     MOR        Morocco         70.0         False
6          AFR      EG          Egypt         45.0         False
7          EUR     ENG        England          NaN          True

Loading a csv in Pandas
Description
Create a dataframe from the file ‘marks.csv’ and print the contents of the dataframe. Open the file from the link above and inspect the required elements in the file (header, separator, etc.). If the top row is a regular entry, do not load it as the column header.

Csv link to download :https://media-doselect.s3.amazonaws.com/generic/A08MajL8qN4rq72EpVJbAP1Rw/marks_1.csv

In [31]:
mark = pd.read_csv('marks_1.csv',sep="|",header = None, names = ["SI NO","NAMES","SUBJECT","TEST 1","TEST 2","TEST 3"])
mark

    SI NO    NAMES      SUBJECT  TEST 1  TEST 2  TEST 3
0       1   Akshay  Mathematics      50      40      80
1       2   Mahima      English      40      33      83
2       3    Vikas  Mathematics      50      42      84
3       4  Abhinav      English      40      31      78
4       5   Mahima      Science      50      40      80
5       6   Akshay      Science      50      49      98
6       7  Abhinav  Mathematics      50      47      94
7       8    Vikas      Science      50      40      80
8       9  Abhinav      Science      50      47      94
9      10    Vikas      English      40      39      98
10     11   Akshay      English      40      35      88
11     12   Mahima  Mathematics      50      43      86

In [ ]:
import numpy as np
import pandas as pd

# The file is stored at the following path:
# 'https://media-doselect.s3.amazonaws.com/generic/A08MajL8qN4rq72EpVJbAP1Rw/marks_1.csv'
# Provide your answer below
df = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/A08MajL8qN4rq72EpVJbAP1Rw/marks_1.csv',sep = "|",header = None)

print(df)